<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Title</title>
</head>
<body>
<p>Программа на языке программирования Pascal оформляется стандартным образом и имеет следующий вид:</p>
<p style="font-family: 'Courier New'">
    <b>Program </b>&lt;имя программы&gt;;
    <br>&lt;раздел описаний, в котором описываются данные&gt;;
    <br><b>Begin</b>
    <br>&emsp;&lt;раздел команд (тело программы)&gt;;
    <br><b>End.</b>
</p>
<p>Рассмотрим на примере правила оформления программы.</p>
<p><b>Пример 1. </b>Написать программу, которая выведет на экран монитора текст.</p>
<p>Запишем программу на языке Pascal.</p>
<p style="font-family: 'Courier New'">
    <b>Program </b>text1;&emsp;&emsp;{Заголовок программы}
    <br><b>Begin</b>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp; {Начало программы}
    <br>&emsp;Write('Я всемогущий компьютер! Жду ваших команд!');
    <br><b>End.</b>&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;{Конец программы}
</p>
<p>Здесь <span style="font-family: 'Courier New'"><b>Program</b> text1;</span> &mdash; заголовок программы,
где <span style="font-family: 'Courier New'">text1</span> &mdash; имя программы
(его пользователь задает самостоятельно). Желательно, чтобы имя программы соответствовало ее содержанию.
Оно может содержать до 255 латинских букв, цифр, знаков подчеркивания (_) и должно начинаться с буквы или
знака подчеркивания. В качестве имен программ либо данных (величин) нельзя использовать имена
зарезервированных в языке программирования слов (например, <span style="font-family: 'Courier New'">Begin, End</span> и др.).
</p>
<p>После каждого предложения в программе на языке Pascal нужно ставить точку с запятой.</p>
<p>После заголовка программы следует тело программы, которое начинается словом <span style="font-family: 'Courier New'">Begin</span>.
После него не ставят точку с запятой.</p>
<p>Команда <span style="font-family: 'Courier New'">Write</span> выводит на экран монитора текст, заключенный в апострофы в скобках.</p>
<p>Словом <span style="font-family: 'Courier New'">End</span> обозначается конец программы. После него обязательно ставят точку.</p>
<p>При вводе текста программы с клавиатуры не имеет значения, какие используются буквы: строчные либо прописные.</p>
<p>В фигурных скобках можно писать комментарии (пояснительный текст, который облегчает понимание программы и не влияет на ее выполнение).
Использование в программе комментариев необязательно.</p>

<input type="file" accept=".pas">
<script>
    /*$.ajax({
     url: 'tasks/robot/linear1.txt',
     success: function (data) {
     }
     });*/
    /*var reForLogin = /^[a-zA-Z][.\-_a-zA-Z\d]{4,18}[\-_a-zA-Z\d]$/;
    var b = reForLogin.test('jjjjjj-');
    alert(b);*/


</script>
</body>
</html>